// Для заданной строки найдите длину самой длинной подстроки в ней , содержащей не более K различных символов.
// Вы можете предположить, что K меньше или равно длине данной строки.

// 1. 
// 2.
// 3.
// 4.
// 5.

function longest_substring_with_k_distinct(str, k) {
  
}

console.log(longest_substring_with_k_distinct('araaci', 2));
console.log(longest_substring_with_k_distinct('araaci', 1));
console.log(longest_substring_with_k_distinct('cbbebi', 3));

// Вы посещаете ферму для сбора фруктов. На ферме есть один ряд фруктовых деревьев. Вам выдадут две корзины, 
// и ваша цель - собрать как можно больше фруктов, которые будут помещены в данные корзины.

// Вам будет предоставлен набор символов, где каждый символ представляет фруктовое дерево. 
//На ферме действуют следующие ограничения:

// 1. В каждой корзине может быть только один вид фруктов. Количество фруктов в корзине не ограничено.
// 2. Вы можете начать с любого дерева, но вы не можете пропустить дерево, раз уж начали. 1

var totalFruit = function(fruits) {
    
};

 
console.log(totalFruit([0,1,2,2]))
console.log(totalFruit([1,2,3,2,2]))


// Учитывая две строки s1 и s2, верните true, если s2 содержит перестановку s1, или false в противном случае.

// Другими словами, верните true, если одна из перестановок s1 является подстрокой s2.

var checkInclusion = function(s1, s2) {
    
};

console.log(checkInclusion("ab",'eidbaooo'))
console.log(checkInclusion("ab","eidboaoo"))